{
  "DarkMode": "DarkMode",
  "LightMode": "LightMode",
  "Cactus": "Cactus",
  "North_America": "North America",
  "Lophophora_fricii": "Lophophora fricii",
  "BuyPopular": "Buy now for $15.99",
  "PopularDescTitle": "Description",
  "PopularDesc": "Lophophora fricii, commonly known as \"spineless cactus,\" is an ornamental plant of the genus Epiphyllum, characterized by white hairs growing on the top and peach-colored flowers blooming in summer.",
  "ProductsTitle": "Our Products",
  "ProductsDesc": "We use the latest wormhole technology for shipping, ensuring that your goods arrive as fresh as they were just returned from the origin.",
  "Unit": "$",
  "BackToHome": "Back to homepage",
  "Details": "Details",
  "Quantity": "Quantity",
  "AddCart": "Add to cart",
  "Added": "added to the cart.",
  "BuyNow": "Buy now",
  "YouMayLike": "You May Also Like",
  "Cart": "Your Cart",
  "Items": "items",
  "Delete": "Delete",
  "Total": "Subtotal",
  "Pay": "Pay",
  "Thank": {
    "Title": "Thank you for your support, your order has been completed!",
    "Content1": "We appreciate you choosing our products and have received your order. Your order is currently being processed and we will ship your purchased items as soon as possible, with an estimated delivery date of a few days from now.",
    "Content2": "Please make sure to double check your shipping address and contact information to ensure a smooth delivery of your order. If you have any questions, please don't hesitate to contact our customer service team.",
    "Content3": "If you need to track your order status, you can log in to your account to check. You can also contact our customer service team, who will be happy to assist you.",
    "Content4": "If you need to cancel or modify your order, please contact us before the order is shipped. If you have any questions or concerns about the purchased items, please feel free to contact our customer service team at any time.",
    "Content5": "Thank you again for your purchase. If you have any feedback or suggestions on our products or services, please don't hesitate to contact us. We look forward to providing you with another high-quality shopping experience!"
  }
}